# SQL Window Functions for Northwind Traders
#### An example implementation using PostgreSQL in a Jupyter Notebook for business analytics.

## Setup

### Importing Libraries

In [1]:
# Import necessary libraries, etc.
import pandas as pd
from configparser import ConfigParser
%load_ext sql

### Connecting to PostgreSQL Database

In [2]:
# Obtaining connection string to connect with PostgreSQL database:  https://daoverflow.com/2019/08/09/how-do-you-hide-secrets-in-jupyter-notebooks/
# Format:  "postgresql://username:{password}@localhost:5432/northwind"
parser = ConfigParser()
_ = parser.read('nb.cfg')
conn_string = parser.get('my_db', 'conn_string')

In [3]:
# SQL statement for creating connection
sql = f"""
{conn_string}
"""
# Connecting
%sql {sql}

## Exploring the Northwind Database

In [4]:
%%sql
SELECT table_name AS name,
       table_type AS type
  FROM information_schema.tables
 WHERE table_schema = 'public' 
   AND table_type IN ('BASE TABLE', 'VIEW');

 * postgresql://postgres:***@localhost:5432/northwind
17 rows affected.

[('territories', 'BASE TABLE'),
 ('order_details', 'BASE TABLE'),
 ('employee_territories', 'BASE TABLE'),
 ('us_states', 'BASE TABLE'),
 ('customers', 'BASE TABLE'),
 ('orders', 'BASE TABLE'),
 ('employees', 'BASE TABLE'),
 ('shippers', 'BASE TABLE'),
 ('products', 'BASE TABLE'),
 ('categories', 'BASE TABLE'),
 ('suppliers', 'BASE TABLE'),
 ('region', 'BASE TABLE'),
 ('customer_demographics', 'BASE TABLE'),
 ('customer_customer_demo', 'BASE TABLE'),
 ('orders_order_details_product_view', 'VIEW'),
 ('employees_orders_view', 'VIEW'),
 ('customers_orders_view', 'VIEW')]

#### Observations:
- The database contains 14 tables and is consistent with the original schema.  
- The 6 tables in the modified schema are all present.

### Checking Samples of Each Table

### `customers`

In [5]:
%%sql
SELECT *
  FROM customers
 LIMIT 2;

 * postgresql://postgres:***@localhost:5432/northwind
2 rows affected.

[('ALFKI', 'Alfreds Futterkiste', 'Maria Anders', 'Sales Representative', 'Obere Str. 57', 'Berlin', None, '12209', 'Germany', '030-0074321', '030-0076545'),
 ('ANATR', 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Owner', 'Avda. de la Constitución 2222', 'México D.F.', None, '05021', 'Mexico', '(5) 555-4729', '(5) 555-3745')]

#### Observations:
- Note that the column `notes` is of text type and will throw errors during retrieval in python.

### `employees`

In [6]:
%%sql
SELECT employee_id, last_name, first_name, title, hire_date, city, region, country
  FROM employees
 LIMIT 2;

 * postgresql://postgres:***@localhost:5432/northwind
2 rows affected.

[(1, 'Davolio', 'Nancy', 'Sales Representative', datetime.date(1992, 5, 1), 'Seattle', 'WA', 'USA'),
 (2, 'Fuller', 'Andrew', 'Vice President, Sales', datetime.date(1992, 8, 14), 'Tacoma', 'WA', 'USA')]

### `orders`

In [7]:
%%sql
SELECT *
  FROM orders
 LIMIT 2;

 * postgresql://postgres:***@localhost:5432/northwind
2 rows affected.

[(10248, 'VINET', 5, datetime.date(1996, 7, 4), datetime.date(1996, 8, 1), datetime.date(1996, 7, 16), 3, 32.38, 'Vins et alcools Chevalier', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France'),
 (10249, 'TOMSP', 6, datetime.date(1996, 7, 5), datetime.date(1996, 8, 16), datetime.date(1996, 7, 10), 1, 11.61, 'Toms Spezialitäten', 'Luisenstr. 48', 'Münster', None, '44087', 'Germany')]

### `categories`

In [8]:
%%sql
SELECT category_name, description
  FROM categories
 LIMIT 2;

 * postgresql://postgres:***@localhost:5432/northwind
2 rows affected.

[('Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 ('Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings')]

#### Observations:
- Note that the `picture` column will throw an error in python as bytea type regarding retrieval and pickling.

### `products`

In [9]:
%%sql
SELECT *
  FROM products
 LIMIT 2;

 * postgresql://postgres:***@localhost:5432/northwind
2 rows affected.

[(1, 'Chai', 8, 1, '10 boxes x 30 bags', 18.0, 39, 0, 10, 1),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19.0, 17, 40, 25, 1)]

### `order_details`

In [10]:
%%sql
SELECT *
  FROM order_details
 LIMIT 2;

 * postgresql://postgres:***@localhost:5432/northwind
2 rows affected.

[(10248, 11, 14.0, 12, 0.0), (10248, 42, 9.8, 10, 0.0)]

### Creating Views for Reuse

### `customers_orders_view`

In [11]:
%%sql
SELECT table_name, column_name
  FROM information_schema.columns
 WHERE table_schema = 'public'
   AND table_name IN ('customers', 'orders')
    ;

 * postgresql://postgres:***@localhost:5432/northwind
25 rows affected.

[('customers', 'customer_id'),
 ('customers', 'company_name'),
 ('customers', 'contact_name'),
 ('customers', 'contact_title'),
 ('customers', 'address'),
 ('customers', 'city'),
 ('customers', 'region'),
 ('customers', 'postal_code'),
 ('customers', 'country'),
 ('customers', 'phone'),
 ('customers', 'fax'),
 ('orders', 'order_id'),
 ('orders', 'customer_id'),
 ('orders', 'employee_id'),
 ('orders', 'order_date'),
 ('orders', 'required_date'),
 ('orders', 'shipped_date'),
 ('orders', 'ship_via'),
 ('orders', 'freight'),
 ('orders', 'ship_name'),
 ('orders', 'ship_address'),
 ('orders', 'ship_city'),
 ('orders', 'ship_region'),
 ('orders', 'ship_postal_code'),
 ('orders', 'ship_country')]

In [12]:
%%sql
CREATE OR REPLACE VIEW customers_orders_view AS
SELECT o.*, 
       c.company_name, c.contact_name, c.contact_title, c.address, c.city, c.region, c.postal_code, c.country, c.phone, c.fax
  FROM customers c
  JOIN orders o
    ON c.customer_id = o.customer_id
;

SELECT * FROM customers_orders_view LIMIT 2;

 * postgresql://postgres:***@localhost:5432/northwind
Done.
2 rows affected.

[(10248, 'VINET', 5, datetime.date(1996, 7, 4), datetime.date(1996, 8, 1), datetime.date(1996, 7, 16), 3, 32.38, 'Vins et alcools Chevalier', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France', 'Vins et alcools Chevalier', 'Paul Henriot', 'Accounting Manager', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France', '26.47.15.10', '26.47.15.11'),
 (10249, 'TOMSP', 6, datetime.date(1996, 7, 5), datetime.date(1996, 8, 16), datetime.date(1996, 7, 10), 1, 11.61, 'Toms Spezialitäten', 'Luisenstr. 48', 'Münster', None, '44087', 'Germany', 'Toms Spezialitäten', 'Karin Josephs', 'Marketing Manager', 'Luisenstr. 48', 'Münster', None, '44087', 'Germany', '0251-031259', '0251-035695')]

### `orders_order_details_products_view`

In [13]:
%%sql
SELECT table_name, column_name
  FROM information_schema.columns
 WHERE table_schema = 'public'
   AND table_name IN ('orders', 'order_details', 'products')
 ORDER BY table_name;

 * postgresql://postgres:***@localhost:5432/northwind
29 rows affected.

[('order_details', 'product_id'),
 ('order_details', 'unit_price'),
 ('order_details', 'order_id'),
 ('order_details', 'quantity'),
 ('order_details', 'discount'),
 ('orders', 'ship_address'),
 ('orders', 'order_id'),
 ('orders', 'freight'),
 ('orders', 'order_date'),
 ('orders', 'required_date'),
 ('orders', 'shipped_date'),
 ('orders', 'ship_via'),
 ('orders', 'customer_id'),
 ('orders', 'ship_city'),
 ('orders', 'ship_region'),
 ('orders', 'ship_postal_code'),
 ('orders', 'ship_country'),
 ('orders', 'ship_name'),
 ('orders', 'employee_id'),
 ('products', 'supplier_id'),
 ('products', 'category_id'),
 ('products', 'unit_price'),
 ('products', 'units_in_stock'),
 ('products', 'units_on_order'),
 ('products', 'reorder_level'),
 ('products', 'discontinued'),
 ('products', 'product_id'),
 ('products', 'quantity_per_unit'),
 ('products', 'product_name')]

In [14]:
%%sql
CREATE OR REPLACE VIEW orders_order_details_product_view AS
SELECT o.*,
       od.product_id, od.unit_price AS unit_price_on_order, od.quantity, od.discount,
       p.supplier_id, p.category_id, p.unit_price AS unit_price_product, p.units_in_stock, p.units_on_order, p.reorder_level, p.discontinued, p.quantity_per_unit, p.product_name
  FROM orders o
  JOIN order_details od
    ON o.order_id = od.order_id
  JOIN products p
    ON od.product_id = p.product_id
;

SELECT *
  FROM orders_order_details_product_view
 LIMIT 2;

 * postgresql://postgres:***@localhost:5432/northwind
Done.
2 rows affected.

[(10248, 'VINET', 5, datetime.date(1996, 7, 4), datetime.date(1996, 8, 1), datetime.date(1996, 7, 16), 3, 32.38, 'Vins et alcools Chevalier', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France', 11, 14.0, 12, 0.0, 5, 4, 21.0, 22, 30, 30, 0, '1 kg pkg.', 'Queso Cabrales'),
 (10248, 'VINET', 5, datetime.date(1996, 7, 4), datetime.date(1996, 8, 1), datetime.date(1996, 7, 16), 3, 32.38, 'Vins et alcools Chevalier', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France', 42, 9.8, 10, 0.0, 20, 5, 14.0, 26, 0, 0, 1, '32 - 1 kg pkgs.', 'Singaporean Hokkien Fried Mee')]

### `employees_orders_view`

In [15]:
%%sql
SELECT table_name, column_name
  FROM information_schema.columns
 WHERE table_schema = 'public'
   AND table_name IN ('employees', 'orders');

 * postgresql://postgres:***@localhost:5432/northwind
32 rows affected.

[('employees', 'employee_id'),
 ('employees', 'last_name'),
 ('employees', 'first_name'),
 ('employees', 'title'),
 ('employees', 'title_of_courtesy'),
 ('employees', 'birth_date'),
 ('employees', 'hire_date'),
 ('employees', 'address'),
 ('employees', 'city'),
 ('employees', 'region'),
 ('employees', 'postal_code'),
 ('employees', 'country'),
 ('employees', 'home_phone'),
 ('employees', 'extension'),
 ('employees', 'photo'),
 ('employees', 'notes'),
 ('employees', 'reports_to'),
 ('employees', 'photo_path'),
 ('orders', 'order_id'),
 ('orders', 'customer_id'),
 ('orders', 'employee_id'),
 ('orders', 'order_date'),
 ('orders', 'required_date'),
 ('orders', 'shipped_date'),
 ('orders', 'ship_via'),
 ('orders', 'freight'),
 ('orders', 'ship_name'),
 ('orders', 'ship_address'),
 ('orders', 'ship_city'),
 ('orders', 'ship_region'),
 ('orders', 'ship_postal_code'),
 ('orders', 'ship_country')]

In [16]:
%%sql
CREATE OR REPLACE VIEW employees_orders_view AS
SELECT o.*,
       e.last_name, e.first_name, e.title, e.title_of_courtesy, e.birth_date, e.hire_date, e.address, 
       e.city, e.region, e.postal_code, e.country, e.home_phone, e.extension, e.reports_to, e.photo_path
  FROM orders o
  JOIN employees e
    ON o.employee_id = e.employee_id
;

SELECT *
  FROM employees_orders_view
 LIMIT 2;

 * postgresql://postgres:***@localhost:5432/northwind
Done.
2 rows affected.

[(10248, 'VINET', 5, datetime.date(1996, 7, 4), datetime.date(1996, 8, 1), datetime.date(1996, 7, 16), 3, 32.38, 'Vins et alcools Chevalier', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France', 'Buchanan', 'Steven', 'Sales Manager', 'Mr.', datetime.date(1955, 3, 4), datetime.date(1993, 10, 17), '14 Garrett Hill', 'London', None, 'SW1 8JR', 'UK', '(71) 555-4848', '3453', 2, 'http://accweb/emmployees/buchanan.bmp'),
 (10249, 'TOMSP', 6, datetime.date(1996, 7, 5), datetime.date(1996, 8, 16), datetime.date(1996, 7, 10), 1, 11.61, 'Toms Spezialitäten', 'Luisenstr. 48', 'Münster', None, '44087', 'Germany', 'Suyama', 'Michael', 'Sales Representative', 'Mr.', datetime.date(1963, 7, 2), datetime.date(1993, 10, 17), 'Coventry House\\nMiner Rd.', 'London', None, 'EC2 7JR', 'UK', '(71) 555-7773', '428', 5, 'http://accweb/emmployees/davolio.bmp')]

## Ranking Employee Sales Performance

In [17]:
%%sql
SELECT table_name
  FROM information_schema.views
 WHERE table_schema = 'public';

 * postgresql://postgres:***@localhost:5432/northwind
3 rows affected.

[('customers_orders_view',),
 ('orders_order_details_product_view',),
 ('employees_orders_view',)]

In [18]:
%%sql
WITH employee_orders_cte AS (
SELECT e.employee_id, 
       e.last_name,
       e.first_name,
       e.title, 
       e.hire_date, 
       e.city,
       e.region,
       e.country,
       e.reports_to,
       e.photo_path, 
       o.order_id, 
       o.order_date,
       o.product_id,
       o.unit_price_on_order,
       o.quantity, 
       o.discount, 
       o.unit_price_product,
       o.product_name
  FROM employees_orders_view e
  JOIN orders_order_details_product_view o
    ON e.order_id = o.order_id
)

SELECT employee_id, first_name || ' ' || last_name AS name, hire_date, ROUND(SUM(unit_price_on_order*quantity)::NUMERIC, 2) AS total_sales,
       RANK() OVER(ORDER BY ROUND(SUM(unit_price_on_order*quantity)::NUMERIC) DESC) AS rank
  FROM employee_orders_cte
 GROUP BY employee_id, first_name || ' ' || last_name, hire_date;

 * postgresql://postgres:***@localhost:5432/northwind
9 rows affected.

[(4, 'Margaret Peacock', datetime.date(1993, 5, 3), Decimal('250187.45'), 1),
 (3, 'Janet Leverling', datetime.date(1992, 4, 1), Decimal('213051.30'), 2),
 (1, 'Nancy Davolio', datetime.date(1992, 5, 1), Decimal('202143.71'), 3),
 (2, 'Andrew Fuller', datetime.date(1992, 8, 14), Decimal('177749.26'), 4),
 (7, 'Robert King', datetime.date(1994, 1, 2), Decimal('141295.99'), 5),
 (8, 'Laura Callahan', datetime.date(1994, 3, 5), Decimal('133301.03'), 6),
 (9, 'Anne Dodsworth', datetime.date(1994, 11, 15), Decimal('82964.00'), 7),
 (6, 'Michael Suyama', datetime.date(1993, 10, 17), Decimal('78198.10'), 8),
 (5, 'Steven Buchanan', datetime.date(1993, 10, 17), Decimal('75567.75'), 9)]

#### Observations:
- There are 3 bands of `total_sales`: 20K+, between 10 and 20K, and under 10K.
- Except for employees ranked 2 through 7, `total_sales` does not correlate with length of employment.

## Running Total of Monthly Sales

In [19]:
%%sql
SELECT DATE_TRUNC('month', order_date) as year_month,
        ROUND(SUM(unit_price_on_order * quantity)::numeric, 2) as sales
   FROM orders_order_details_product_view
  GROUP BY DATE_TRUNC('month', order_date)
  ORDER BY DATE_TRUNC('month', order_date)
 ;

 * postgresql://postgres:***@localhost:5432/northwind
23 rows affected.

[(datetime.datetime(1996, 7, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=68400))), Decimal('30192.10')),
 (datetime.datetime(1996, 8, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=68400))), Decimal('26609.40')),
 (datetime.datetime(1996, 9, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=68400))), Decimal('27636.00')),
 (datetime.datetime(1996, 10, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=68400))), Decimal('41203.60')),
 (datetime.datetime(1996, 11, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))), Decimal('49704.00')),
 (datetime.datetime(1996, 12, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))), Decimal('50953.40')),
 (datetime.datetime(1997, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))), Decimal('66692.80')),
 (datetime.datetime(1997, 2, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))), Decimal('41207.20')),
 (datetime.datetime(1997, 3, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))), Decimal('39979.90')),
 (datetime.datetime(1997, 4, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))), Decimal('55699.39')),
 (datetime.datetime(1997, 5, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=68400))), Decimal('56823.70')),
 (datetime.datetime(1997, 6, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=68400))), Decimal('39088.00')),
 (datetime.datetime(1997, 7, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=68400))), Decimal('55464.93')),
 (datetime.datetime(1997, 8, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=68400))), Decimal('49981.69')),
 (datetime.datetime(1997, 9, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=68400))), Decimal('59733.02')),
 (datetime.datetime(1997, 10, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=68400))), Decimal('70328.50')),
 (datetime.datetime(1997, 11, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))), Decimal('45913.36')),
 (datetime.datetime(1997, 12, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))), Decimal('77476.26')),
 (datetime.datetime(1998, 1, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))), Decimal('100854.72')),
 (datetime.datetime(1998, 2, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))), Decimal('104561.95')),
 (datetime.datetime(1998, 3, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))), Decimal('109825.45')),
 (datetime.datetime(1998, 4, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=64800))), Decimal('134630.56')),
 (datetime.datetime(1998, 5, 1, 0, 0, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=68400))), Decimal('19898.66'))]

#### Alternate code example with window function

In [20]:
%%sql
WITH monthly_sales AS (
SELECT EXTRACT(YEAR FROM order_date) AS year, EXTRACT(MONTH FROM order_date) AS month,
       ROUND(SUM(unit_price_on_order*quantity) OVER(PARTITION BY EXTRACT(YEAR FROM order_date), EXTRACT(MONTH FROM order_date))::NUMERIC, 2) AS total_sales
  FROM orders_order_details_product_view
 ORDER BY EXTRACT(YEAR FROM order_date), EXTRACT(MONTH FROM order_date)
)

SELECT year, month, 
       ROUND(AVG(total_sales), 2) as sales
  FROM monthly_sales
 GROUP BY year, month
 ORDER BY year, month;

 * postgresql://postgres:***@localhost:5432/northwind
23 rows affected.

[(Decimal('1996'), Decimal('7'), Decimal('30192.10')),
 (Decimal('1996'), Decimal('8'), Decimal('26609.40')),
 (Decimal('1996'), Decimal('9'), Decimal('27636.00')),
 (Decimal('1996'), Decimal('10'), Decimal('41203.60')),
 (Decimal('1996'), Decimal('11'), Decimal('49704.00')),
 (Decimal('1996'), Decimal('12'), Decimal('50953.40')),
 (Decimal('1997'), Decimal('1'), Decimal('66692.80')),
 (Decimal('1997'), Decimal('2'), Decimal('41207.20')),
 (Decimal('1997'), Decimal('3'), Decimal('39979.90')),
 (Decimal('1997'), Decimal('4'), Decimal('55699.39')),
 (Decimal('1997'), Decimal('5'), Decimal('56823.70')),
 (Decimal('1997'), Decimal('6'), Decimal('39088.00')),
 (Decimal('1997'), Decimal('7'), Decimal('55464.93')),
 (Decimal('1997'), Decimal('8'), Decimal('49981.69')),
 (Decimal('1997'), Decimal('9'), Decimal('59733.02')),
 (Decimal('1997'), Decimal('10'), Decimal('70328.50')),
 (Decimal('1997'), Decimal('11'), Decimal('45913.36')),
 (Decimal('1997'), Decimal('12'), Decimal('77476.26')),
 (Decimal('1998'), Decimal('1'), Decimal('100854.72')),
 (Decimal('1998'), Decimal('2'), Decimal('104561.95')),
 (Decimal('1998'), Decimal('3'), Decimal('109825.45')),
 (Decimal('1998'), Decimal('4'), Decimal('134630.56')),
 (Decimal('1998'), Decimal('5'), Decimal('19898.66'))]

### Month-Over-Month Sales Growth

In [21]:
%%sql
WITH monthly_sales AS (
SELECT EXTRACT(YEAR FROM order_date) as year, 
       EXTRACT(MONTH FROM order_date) as month,
       ROUND(SUM(unit_price_on_order*quantity)::NUMERIC, 2) as sales
  FROM orders_order_details_product_view
 GROUP BY EXTRACT(YEAR FROM order_date), EXTRACT(MONTH FROM order_date)
 ORDER BY EXTRACT(YEAR FROM order_date), 
       EXTRACT(MONTH FROM order_date)
)
SELECT year, month, sales,
       ROUND((sales - LAG(sales) OVER(ORDER BY year, month))/sales * 100::NUMERIC, 2) AS monthly_sales_growth_rate
  FROM monthly_sales;

 * postgresql://postgres:***@localhost:5432/northwind
23 rows affected.

[(Decimal('1996'), Decimal('7'), Decimal('30192.10'), None),
 (Decimal('1996'), Decimal('8'), Decimal('26609.40'), Decimal('-13.46')),
 (Decimal('1996'), Decimal('9'), Decimal('27636.00'), Decimal('3.71')),
 (Decimal('1996'), Decimal('10'), Decimal('41203.60'), Decimal('32.93')),
 (Decimal('1996'), Decimal('11'), Decimal('49704.00'), Decimal('17.10')),
 (Decimal('1996'), Decimal('12'), Decimal('50953.40'), Decimal('2.45')),
 (Decimal('1997'), Decimal('1'), Decimal('66692.80'), Decimal('23.60')),
 (Decimal('1997'), Decimal('2'), Decimal('41207.20'), Decimal('-61.85')),
 (Decimal('1997'), Decimal('3'), Decimal('39979.90'), Decimal('-3.07')),
 (Decimal('1997'), Decimal('4'), Decimal('55699.39'), Decimal('28.22')),
 (Decimal('1997'), Decimal('5'), Decimal('56823.70'), Decimal('1.98')),
 (Decimal('1997'), Decimal('6'), Decimal('39088.00'), Decimal('-45.37')),
 (Decimal('1997'), Decimal('7'), Decimal('55464.93'), Decimal('29.53')),
 (Decimal('1997'), Decimal('8'), Decimal('49981.69'), Decimal('-10.97')),
 (Decimal('1997'), Decimal('9'), Decimal('59733.02'), Decimal('16.32')),
 (Decimal('1997'), Decimal('10'), Decimal('70328.50'), Decimal('15.07')),
 (Decimal('1997'), Decimal('11'), Decimal('45913.36'), Decimal('-53.18')),
 (Decimal('1997'), Decimal('12'), Decimal('77476.26'), Decimal('40.74')),
 (Decimal('1998'), Decimal('1'), Decimal('100854.72'), Decimal('23.18')),
 (Decimal('1998'), Decimal('2'), Decimal('104561.95'), Decimal('3.55')),
 (Decimal('1998'), Decimal('3'), Decimal('109825.45'), Decimal('4.79')),
 (Decimal('1998'), Decimal('4'), Decimal('134630.56'), Decimal('18.42')),
 (Decimal('1998'), Decimal('5'), Decimal('19898.66'), Decimal('-576.58'))]

#### Observations:
- Sales peaked in Q1 of 1998, then abruptly plummeted to the lowest in the data set.
- Let us check the end date to see if the data was abbreviated for that month.

In [23]:
%%sql
SELECT MAX(order_date)
  FROM orders;

 * postgresql://postgres:***@localhost:5432/northwind
1 rows affected.

[(datetime.date(1998, 5, 6),)]

#### Observations:
- That was indeed the case, so the low value for May, 1998 can be disregarded.
- With some fluctuation in the first two years, the overall trend has been a good increase in total sales.

## Identifying High-Value Customers: customers with above-average order values

In [24]:
%%sql
SELECT table_name
  FROM information_schema.views
 WHERE table_schema = 'public';

 * postgresql://postgres:***@localhost:5432/northwind
3 rows affected.

[('customers_orders_view',),
 ('orders_order_details_product_view',),
 ('employees_orders_view',)]

In [25]:
%%sql
WITH customer_order_totals AS (
SELECT c.customer_id,
       ROUND(SUM(o.unit_price*o.quantity)::NUMERIC, 2) AS order_total
  FROM customers_orders_view c
  JOIN order_details o
    ON c.order_id = o.order_id
 GROUP BY c.customer_id
),
order_category AS (
SELECT *,
       CASE
        WHEN order_total > AVG(order_total) OVER() THEN 'Above Average'
        ELSE 'Average/Below Average'
       END AS order_category
  FROM customer_order_totals
)
SELECT customer_id, 
       COUNT(*) as num_above_avg
  FROM order_category
 WHERE order_category = 'Above Average'
 GROUP BY customer_id
 ORDER BY COUNT(*) DESC
;

 * postgresql://postgres:***@localhost:5432/northwind
29 rows affected.

[('BERGS', 1),
 ('BLONP', 1),
 ('BONAP', 1),
 ('BOTTM', 1),
 ('ERNSH', 1),
 ('FOLKO', 1),
 ('FRANK', 1),
 ('GREAL', 1),
 ('HANAR', 1),
 ('HILAA', 1),
 ('HUNGO', 1),
 ('KOENE', 1),
 ('LEHMS', 1),
 ('LILAS', 1),
 ('LINOD', 1),
 ('MEREP', 1),
 ('OLDWO', 1),
 ('PICCO', 1),
 ('QUEEN', 1),
 ('QUICK', 1),
 ('RATTC', 1),
 ('RICSU', 1),
 ('SAVEA', 1),
 ('SEVES', 1),
 ('SIMOB', 1),
 ('SUPRD', 1),
 ('VAFFE', 1),
 ('WARTH', 1),
 ('WHITC', 1)]

In [26]:
%%sql
SELECT COUNT(DISTINCT customer_id)
  FROM orders;

 * postgresql://postgres:***@localhost:5432/northwind
1 rows affected.

[(89,)]

#### Observations:
- Of the 89 customers who actively placed orders, 29 of them had a single order that was above the average total for all orders.

## Percentage of Sales for Each Category

In [27]:
%%sql
SELECT table_name
  FROM information_schema.views
 WHERE table_schema = 'public';

 * postgresql://postgres:***@localhost:5432/northwind
3 rows affected.

[('customers_orders_view',),
 ('orders_order_details_product_view',),
 ('employees_orders_view',)]

In [28]:
%%sql
WITH order_details_category AS (
SELECT c.category_name,
       ROUND(SUM(o.unit_price_on_order*o.quantity)::NUMERIC, 2) as sales
  FROM categories c
  JOIN products p
    ON c.category_id = p.category_id
  JOIN orders_order_details_product_view o
    ON o.product_id = p.product_id
 GROUP BY c.category_name
)

SELECT category_name,
       ROUND(sales/SUM(sales) OVER() * 100::NUMERIC, 2) AS percentage_total_sales
  FROM order_details_category
 ORDER BY percentage_total_sales DESC;

 * postgresql://postgres:***@localhost:5432/northwind
8 rows affected.

[('Beverages', Decimal('21.15')),
 ('Dairy Products', Decimal('18.56')),
 ('Meat/Poultry', Decimal('13.16')),
 ('Confections', Decimal('13.08')),
 ('Seafood', Decimal('10.46')),
 ('Condiments', Decimal('8.39')),
 ('Produce', Decimal('7.77')),
 ('Grains/Cereals', Decimal('7.44'))]

#### Observations:
- Beverages and Dairy Products categories contribute most to total sales.
- Produce and Grains/Cereals are the bottom contributors.

## Top Products Per Category

In [54]:
%%sql
WITH product_sales AS (
SELECT product_id, product_name, category_id,
       ROUND(SUM(unit_price_on_order*quantity)::NUMERIC, 2) as sales
  FROM orders_order_details_product_view o
 GROUP BY product_id, product_name, category_id
),
ranked_sales AS (
SELECT c.category_name, p.product_name, p.sales,
       ROW_NUMBER() OVER(PARTITION BY c.category_name
                              ORDER BY p.sales DESC) AS sales_rank
  FROM product_sales p
  JOIN categories c
    ON p.category_id = c.category_id
)

SELECT category_name, product_name, sales
  FROM ranked_sales
 WHERE sales_rank <=3;

 * postgresql://postgres:***@localhost:5432/northwind
24 rows affected.

[('Beverages', 'Côte de Blaye', Decimal('149984.20')),
 ('Beverages', 'Ipoh Coffee', Decimal('25079.20')),
 ('Beverages', 'Chang', Decimal('18559.20')),
 ('Condiments', 'Vegie-spread', Decimal('17696.30')),
 ('Condiments', "Sirop d'érable", Decimal('16438.80')),
 ('Condiments', 'Louisiana Fiery Hot Pepper Sauce', Decimal('14607.00')),
 ('Confections', 'Tarte au sucre', Decimal('49827.90')),
 ('Confections', "Sir Rodney's Marmalade", Decimal('23635.80')),
 ('Confections', 'Gumbär Gummibärchen', Decimal('21534.90')),
 ('Dairy Products', 'Raclette Courdavault', Decimal('76296.00')),
 ('Dairy Products', 'Camembert Pierrot', Decimal('50286.00')),
 ('Dairy Products', 'Mozzarella di Giovanni', Decimal('25738.80')),
 ('Grains/Cereals', 'Gnocchi di nonna Alice', Decimal('45121.20')),
 ('Grains/Cereals', 'Wimmers gute Semmelknödel', Decimal('23009.00')),
 ('Grains/Cereals', 'Singaporean Hokkien Fried Mee', Decimal('9332.40')),
 ('Meat/Poultry', 'Thüringer Rostbratwurst', Decimal('87736.40')),
 ('Meat/Poultry', 'Alice Mutton', Decimal('35482.20')),
 ('Meat/Poultry', 'Perth Pasties', Decimal('21510.20')),
 ('Produce', 'Manjimup Dried Apples', Decimal('44742.60')),
 ('Produce', 'Rössle Sauerkraut', Decimal('26865.60')),
 ('Produce', "Uncle Bob's Organic Dried Pears", Decimal('22464.00')),
 ('Seafood', 'Carnarvon Tigers', Decimal('31987.50')),
 ('Seafood', 'Ikura', Decimal('22140.20')),
 ('Seafood', 'Boston Crab Meat', Decimal('19048.30'))]

#### Observations:
- The wine, Côte de Blaye dominates as the top contributing product to sales.

## Summary
We have illustrated the ease of connecting to a database in PostgreSQL within a Jupyter notebook and the ease of coding in SQL using the SQL Magic commands.  SQL Common Table Expressions, Views, and Window Functions were leveraged to streamline specific business queries.  Note that beyond the magic commands, none of the coding was done in Python.